# frozen_string_literal: true

module BCDice
  module GameSystem
    class BeginningIdol < Base
      module RandomEventTable
        TABLE_EVEN = {
          name: "オンイベント表",
          table: {
            11 => ["雨女は誰？", 96],
            12 => ["千客万来☆アイドル喫茶", 97],
            13 => ["フチドル", 98],
            14 => ["生放送は踊る", 99],
            15 => ["貸し切りプールの誘惑", 100],
            16 => ["ケーオンストリート！", 101],
            21 => ["アイドル×アニメ×ドリーマー！", 102],
            22 => ["一日警察署長、緊急出動!?", 103],
            23 => ["アイドルフィン！", 104],
            24 => ["「カラオケ採点ガチバトル☆」", 105],
            25 => ["「大正乙女ろまんてぃっく」", 106],
            26 => ["鳩時計ラジオ", 107],
            31 => ["「ガチ学院」ＣＭ", 108],
            32 => ["「カラフルアイスクリーム」モデル", 109],
            33 => ["忙しすぎる毎日", 110],
            34 => ["悩める新人デザイナー", 112],
            35 => ["「スクール☆ライフ」", 113],
            36 => ["魔法のように", 114],
            41 => ["食レポとその後", 115],
            42 => ["ソロライブ！", 116],
            43 => ["お昼の放送", 117],
            44 => ["文化祭！", 118],
            45 => ["商店街を救え！", 120],
            46 => ["二つの仕事", 121],
            51 => ["温泉にて", 122],
            52 => ["アイドル探偵と豪華客船", 124],
            53 => ["のうぎょう", 125],
            54 => ["コント撮影", 127],
            55 => ["アイドルＶＳサメ", 128],
            56 => ["駅前で歌う", 130],
            61 => ["街の清掃ボランティア", 131],
            62 => ["ミニユニット活動", 132],
            63 => ["カブトムシ狩り", 134],
            64 => ["ポスター作り", 135],
            65 => ["メロディ", 136],
            66 => ["さいてい新聞部の取材", 138],
          }
        }.freeze

        TABLE_ODD = {
          name: "オフイベント表",
          table: {
            11 => ["アイドル、未知との遭遇", 139],
            12 => ["神様おねがい！", 140],
            13 => ["プチ合宿の罠!?", 141],
            14 => ["どこかで会ったような……", 142],
            15 => ["アイデンティティがっ！", 143],
            16 => ["ホリダシ×オオソウジ", 144],
            21 => ["エンドレス!?　握手会", 146],
            22 => ["不安な路線変更", 147],
            23 => ["全力ねこレース", 148],
            24 => ["恐怖の再テスト！", 149],
            25 => ["たくさんのファンレター", 150],
            26 => ["夕暮れの帰り道。", 152],
            31 => ["どきどき♪　調理実習", 153],
            32 => ["超アイドル衣装？", 154],
            33 => ["おもいでの修学旅行", 156],
            34 => ["アルバイト！", 158],
            35 => ["ドライブしよう！", 159],
            36 => ["ファミレス攻防戦", 160],
            41 => ["総合練習", 162],
            42 => ["歌声はお腹から", 164],
            43 => ["メイクレッスン基本から", 165],
            44 => ["怪我", 166],
            45 => ["エゴサ", 168],
            46 => ["喫茶店でひと息", 169],
            51 => ["天体観測ツアー", 170],
            52 => ["謎のコーチ", 172],
            53 => ["屋上にて", 174],
            54 => ["クラスメイトより", 176],
            55 => ["最強アイドル伝", 177],
            56 => ["イメチェンしよう", 178],
            61 => ["郊外ショッピング施設", 179],
            62 => ["お見舞い", 180],
            63 => ["ライブを観よう！", 181],
            64 => ["頂を目指す", 182],
            65 => ["重いコンダラ", 183],
            66 => ["アイドル改造計画", 184],
          }
        }.freeze

        module_function

        # @param randomizer [BCDice::Randomizer]
        # @return [String]
        def roll(randomizer)
          first_index = randomizer.roll_once(6)
          d66_index = randomizer.roll_d66(D66SortType::NO_SORT)

          table = first_index.even? ? TABLE_EVEN : TABLE_ODD
          chosen = table[:table][d66_index]

          return "ランダムイベント ＞ (1D6) ＞ #{first_index}\n#{table[:name]} ＞ [#{d66_index}] ＞ #{chosen[0]}（『ビギニングロード』#{chosen[1]}ページ）"
        end
      end
    end
  end
end
